{
  "dorms:pawn":
  {
    "titleText":"Pawn",
    "imageLink":"",
    "descriptionText":"Migorn understands that classes and exams can be stressful. To combat this, the Pawn dorm is designed to be soothing and sociable. As a result the dorm has attracted many of the students who don't take studying as seriously as the ought to. This is not where you go to get help on your homework. It is however a dorm that facilitates friendships as there is no 'ruling elite' or people vying to be on top of the food chain. Just a bunch of kids that don't want to exclude a stranger, hence they are popular with other dorms too. The commons room is filled with couches and pillows, many students building forts and having play fights together. Alternatively the shelves are stocked with all kinds of board games, with students making up their own games. Most people keep the door to their bedrooms open and chatting can be heard throughout the halls.<br/><br/>Pawns are looked down upon by many students for being lazy and not taking school seriously. It's particularly students from the Rooks dorm that feel this way, and they are the reason why the Pawns don't have a larger budget. Pawns have been asking for a pool for ages but have always been denied. Broken items won't be replaced right away either, so you will be popular if you have enchantment magic and can fix things."
  },
  "dorms:rook":
  {
    "titleText":"Rook",
    "imageLink":"",
    "descriptionText":"Rooks live in a beautiful, clean environment... if you discount the books lying all around. The dorm is the largest, owing in part to the Rooks making up most of the student council. There are many ambitious students in the Rook dorm, or children of rich and influential people who are pressured to work hard and play little. There are many who take their studies very serious, some a tad too much. They don't see too much socialization, and most of the rooms are single-student only, with the doors closed at all times in order to focus. The party organizers work hard to make sure there are events to take stress off, and often ask for help from the Pawns. The cross-dorm events are always the most successful and the most remembered ones. The elites and snobs rarely attend these cross-dorm events, due to their disdain for the 'lazy Pawns'. <br /><br /> You can gain a lot of influence over the school by being a Rook, and your odds of being voted into the school council are greater. Besides that, living here gives you plenty of opportunities to network with the children of the elites. That or you could simply be their friend and take off some of their stress. There's many a shy, overworked student to be found, and a friendship could mean the world to them."
  },
  "dorms:knight":
  {
    "titleText":"Knight",
    "imageLink":"",
    "descriptionText":"As the name implies, the Knight dorm is stock-full of people aspiring to become great heros of renown, whether it be by flinging spells or enhancing your body's abilities with magic. When you put so many hotheads together conflict can happen but the older students are doing a good job at de-escalating fights (even if some like egging them on). Besides being competitive most people are generally nice and sociable if a tad short on concentration. Expect your door to get knocked several times during a study session. You would need to actively try in order to live in the Knight dorm and not make any friends. Or friendly rivals. <br /><br /> Once per month the dorm hosts mock battles or makes an expedition. Twice per year they host a spectacular competition where all students are allowed to participate and tickets are sold throughout the land. Last year the hosts managed to smuggle in some monsters. The teachers were not happy and the hosts were punished harshly, even if they were viewed as heroes by the spectators and other students. How you are viewed and treated by the other students depends on how well you do in these mock battles. The dorm uses a ranking system, where you gain perks over the students below your rank. It is used for mild teasing, and you need to be able to handle the banter."
  },
  "dorms:bishop":
  {
    "titleText":"Bishop",
    "imageLink":"",
    "descriptionText":"The Bishops tend to shy away from any drama caused by other dorms, and instead keep to themselves. They see themselves not as belonging to a dorm, but just being students. The dorm is thus ideal for those who want to do their own thing and be social on their own terms. This does mean many other students feel Bishops come off as being aloof. The commons room is small and usually empty as people either spend time in the community garden, in their rooms or with friends from the other dorms. In the basement is some fairly basic apothecary cauldrons that students are encouraged to use. As the catacombs are nearby the dorm is one of the few places on campus where one can meet ghosts. They are docile, but do love a good prank. Going on a date nearby will end in catastrophe, but will at least make for a great story. <br /><br /> When harvest season comes anyone who has grown crops, made potions, or anything else they wish to sell can go on an expedition to the closest city and try to sell their items. It lasts a fortnight and is also treated as a mini-holiday. It is one of the few events that let students lollygag in a city, with most expeditions being school related such as gathering ingredients or fighting monsters."
  }
}